Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_1_calculating_your_pension_under_bi_lateral_social_security_agreements.html.txt.tmx
Source language: en
Languages: ga

source: Case study 1: Calculating your pension under EU social security agreements
ga: Cás-staidéar 1: Do phinsean a ríomh faoi chomhaontuithe slándála sóisialaí an AE

source: This example shows how entitlement to State Pension (Contributory) is calculated under EU social security agreements
ga: Léiríonn an sampla seo conas a dhéantar teidlíocht ar Phinsean Stáit (Ranníocach) a ríomh faoi chomhaontuithe slándála sóisialaí an AE

source: Peter is turning 66 years of age and wants to know if he will qualify for a State Pension (Contributory)
ga: An bhliain seo chugainn, beidh sé 66 bliain d’aois agus teastaíonn uaidh a fháil amach an mbeidh sé i dteideal Pinsean Stáit (Ranníocach) a fháil

source: He started his working life in Ireland and worked in Ireland for 2 years in total
ga: Nuair a bheidh Peter ag dul ar scor, beidh 364 ranníocaíocht íoctha aige in Éirinn

source: He has worked in Ireland for the last 5 years and before that he worked in Germany for 23 years and paid 1,196 contributions there
ga: Bhí sé ag obair sa Ghearmáin ar feadh 23 mbliana agus d’íoc sé 1,196 ranníocaíocht ansin

source: He doesn't have any breaks in his employment record in Germany, that is, he worked in Germany continuously for 23 years immediately before coming back to Ireland
ga: Ní raibh aon bhriseadh ina chuid taifead fostaíochta sa Ghearmáin i ’oibrigh sé go leanúnach sa Ghearmáin ar feadh 23 mbliana sular tháinig sé go hÉirinn

source: Peter's wife Maria is 61 years of age, her only income is from work
ga: Tá bean chéile Peter, Maria, 61 bliain d’aois, níl aon ioncam aici seachas a hioncam ón obair

source: She earns €250 per week
ga: Tuileann sí €250 in aghaidh na seachtaine

source: Firstly you must check whether Peter would qualify for an Irish State Pension based on his Irish contributions alone
ga: Is éard atá ann ná ráta an Phinsin Stáit (Ranníocach) a bheadh Peter i dteideal a fháil dá ndéanfaí a ranníocaíochtaí ar fad a mheasúnú mar ranníocaíochtaí Éireannacha

source: Peter's Irish contributions: 364
ga: Líon iomlán na ranníocaíochtaí inmheasúnaithe ar fad atá ag Peter: 364 + 1,196 = 1,560 ranníocaíocht

source: Total number of years worked (since entering into insurable employment to the end of the last complete tax year before reaching pension age): 40 years
ga: Líon iomlán na mblianta a oibríodh = 40 bliana

source: Total number of contributions by the number of years worked: 364 ÷ 40 = 9.1
ga: Líon iomlán na ranníocaíochtaí roinnte faoi líon na mblianta a oibríodh: 1,560 ÷ 40 = 39

source: Peter's yearly average number of contributions is 9.1
ga: Dá bhrí sin is ionann a ráta barúlach pinsin agus ráta uasta an Phinsin Stáit (Ranníocach) de €209.70

source: He would not qualify for an Irish State Pension (Contributory)
ga: Is é an méadú dá bhean chéile mar dhuine aosaithe cáilithe ná €59.40. Móide

source: Calculate Peter’s notional rate of pension
ga: A = an ráta barúlach pinsin

source: To calculate the notional rate of pension, find the total of all Peter’s contributions (both foreign and Irish) divided by the number of years since he entered into insurable employment to get his yearly average
ga: C = líon iomlán na ranníocaíochtaí (Éireannacha agus eachtracha)

source: Total of all Peter's assessable contributions: 364 +1,196 = 1,560 contributions
ga: €269.10 x 364 = €97,952

source: Total number of years since entering into insurable employment to the end of the last complete tax year before reaching pension age: 40 years
ga: Ansin déan €97,952 a roinnt faoi líon iomlán na ranníocaíochtaí Éireannacha agus Briotanacha a ríomhamar níos luaithe mar 1,560 ceann:

source: Peter's notional rate of pension is €209.70 (the rate paid in 2016 for people with a yearly average of contributions between 30 and 39)
ga: Faigheann Peter ráta an Phinsin Stáit (Ranníocach) de €62.79 lena n-áirítear méadú dá bhean chéile mar dhuine aosaithe cáilithe
